# DirectShapeLibrary Properties

---
The DirectShapeLibrary type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace